package com.lesson.l5.online.task.medium.Collections;

/**
 * 1. Создай список строк в методе main.
 * 2. Добавь в него 10 строчек с клавиатуры, но только добавлять не в конец списка, а в начало.
 * 3. Используя цикл выведи содержимое на экран, каждое значение с новой строки.
 */
/* Требования:
 * Объяви переменную типа список строк и сразу проинициализируй ee.
 * Программа должна считывать 10 строк с клавиатуры и добавлять их в список.
 * Программа должна добавлять строки в начало списка.
 * Программа должна выводить список на экран, каждое значение с новой строки.
 */
public class Main4 {
    public static void main(String[] args) {
        
    }
}
