package com.lesson.l4.easy;


/**
Ввести с клавиатуры два целых числа, и вывести на экран минимальное из них.
Если два числа равны между собой, необходимо вывести любое.
 */

/*Требования:
Программа должна считывать числа c клавиатуры.
Программа должна выводить число на экран.
Программа должна выводить на экран минимальное из двух целых чисел.
Если два числа равны между собой, необходимо вывести любое
 */
public class Main {
    public static void main(String[] args) {
        //Написать здесь код
    }
}
