package com.lesson.l4.easy;


/**
 * Ввести с клавиатуры четыре числа, и вывести максимальное из них.
 * Если числа равны между собой, необходимо вывести любое.
 */
/*
Требования:
Программа должна считывать числа c клавиатуры.
Программа должна выводить число на экран.
Программа должна выводить на экран максимальное из четырёх чисел.
Если максимальных чисел несколько, необходимо вывести любое из них.
 */
public class Main2 {
    public static void main(String[] args) {
        //Напиши здесь код
    }
}
